from gen_fib import my_genn

def fib(n):
    """Функция-обертка"""
    gen = my_genn()
    return gen.send(n)

def test_fib_0():
    assert fib(0) == [], "fib(0) должно возвращать пустой список"

def test_fib_1():
    assert fib(1) == [0], "Тривиальный случай n = 1, список [0]"

def test_fib_2():
   assert fib(2) == [0, 1], "fib(2) должно быть [0, 1]"

def test_fib_3():
    assert fib(3) == [0, 1, 1], "fib(3) должно быть [0, 1, 1]"

def test_fib_5():
    assert fib(5) == [0, 1, 1, 2, 3], "fib(5) должно быть [0, 1, 1, 2, 3]"

def test_fib_50():
    assert fib(50) == [
        0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 
6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 
1346269, 2178309, 3524578, 5702887, 9227465, 14930352, 24157817, 39088169, 
63245986, 102334155, 165580141, 267914296, 433494437, 701408733, 1134903170, 
1836311903, 2971215073, 4807526976, 7778742049
    ], "fib(50) должно возвращать правильный список Фибоначчи"

test_fib_0()
test_fib_1()
test_fib_2()
test_fib_3()
test_fib_5()
test_fib_50()
print("Все тесты прошли успешно!")
